[
    {"title": "Top 5 Programming Lanaguages", "content": "In today's world, programming skills are needed for the majority of tech jobs. A good tech career necessitates the knowledge of programming languages. After all, thousands of different programming languages are used by people all over the world.", "user_id": 1},
    {"title": "Sublime Text Tips and Tricks", "content": "After exploring it for a while, you might be surprised that you can do quite a number of cool things in SublimeText. We went in and dug around for a bit and here are just some of the tips and tricks that we think you would like to play with.", "user_id": 1},
    {"title": "The Best Programming Podcasts", "content": "Podcasts have grown in popularity over the years and they now cover a very wide range of subjects. There’s no shortage of high quality shows that will help you become more knowledgeable, keep up with your favorite tools, and help you develop a broader perspective on the ever-changing field that is technology.", "user_id": 1},
    {"title": "Tips For Public Speaking", "content": "When you’re nervous, your heart rate speeds up, you begin to sweat, and—if you’re not careful—you can easily work yourself into an anxiety attack. To take a few minutes before delivering your speech to close your eyes and take a couple of deep breaths. Calm your body so you can enter the stage (or speaking area) with a certain level of peace and not feeling all frenzied.", "user_id": 1},
    {"title": "Tips For Resume", "content": "Your resume should not have every work experience you’ve ever had listed on it. Think of your resume not as a comprehensive list of your career history, but as a marketing document selling you as the perfect person for the job.", "user_id": 1},
    {"title": "How I Record My Videos", "content": "Imagine you need to show someone how to log in to an online account or how to use a feature in a product. You could write out an email. Or you could capture your screen and take a few screenshots.", "user_id": 1},
    {"title": "Music To Listen To While Coding", "content": "Coding is the ultimate mind exercise, it involves extreme attention to detail and a whole lot of critical thinking. Listening to music can greatly help, with its ability to motivate and relax the mind, it’s the perfect companion for coding.", "user_id": 1},
    {"title": "Best Cloud Platforms", "content": "Cloud computing provides maintainability and automatic updates of new software, OS, databases, and third-party software. It also reduces IT labor cost for a business.", "user_id": 1},
    {"title": "Top Testing Technique", "content": "An example of ad-hoc testing is exploratory testing, which is defined like simultaneous learning, and means that tests are dynamically designed, executed, and modified. When we first look at a new feature or system, we don’t know much about the system.", "user_id": 1},
    {"title": "Data Structure & Algorithm", "content": "A data structure is a named location that can be used to store and organize data. And, an algorithm is a collection of steps to solve a particular problem. Learning data structures and algorithms allow us to write efficient and optimized computer programs.", "user_id": 1},
    {"title": "Graph Theory", "content": "In mathematics, graph theory is the study of graphs, which are mathematical structures used to model pairwise relations between objects. A graph in this context is made up of vertices which are connected by edges.", "user_id": 1},
    {"title": "Tree Traversal Technique", "content": "In computer science, tree traversal (also known as tree search and walking the tree) is a form of graph traversal and refers to the process of visiting (e.g. retrieving, updating, or deleting) each node in a tree data structure, exactly once.", "user_id": 1},
    {"title": "Most Efficient Algorithm", "content": "Quicksort is one of the most efficient sorting algorithms, and this makes of it one of the most used as well. The first thing to do is to select a pivot number, this number will separate the data, on its left are the numbers smaller than it and the greater numbers on the right.", "user_id": 1},
    {"title": "Best Laptops For Developers", "content": "Coding involves lots of typing, so the best laptops for programming should also come with excellent keyboards that feel comfortable and responsive to use, along with large and accurate trackpads as well.", "user_id": 1},
    {"title": "Best Laptops For Students", "content": "Choosing from the best student laptops is one of the wisest investments you can make for the student in your life. While most students have now returned to classrooms, there's still a lot of remote learning, so laptops remain incredibly important.", "user_id": 1}
]